Tekla.Structures.ModelInternal.RebarHookDataNullable
The RebarHookDataNullable class is a nullable version of RebarHookData.

Tekla.Structures.ModelInternal.RebarHookDataNullable.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarHookDataNullable class.

Tekla.Structures.ModelInternal.RebarHookDataNullable.ToStruct(Tekla.Structures.ModelInternal.dotRebarHookData_t@)
The to struct method.
p: The dotRebarHookData_t struct.

Tekla.Structures.ModelInternal.RebarHookDataNullable.FromStruct(Tekla.Structures.ModelInternal.dotRebarHookData_t@)
The from struct method.
p: The dotRebarHookData_t struct.

Tekla.Structures.ModelInternal.RebarHookDataNullable.Shape
Gets or sets the shape.

Tekla.Structures.ModelInternal.RebarHookDataNullable.Angle
Gets or sets the angle.

Tekla.Structures.ModelInternal.RebarHookDataNullable.Radius
Gets or sets the radius.

Tekla.Structures.ModelInternal.RebarHookDataNullable.Length
Gets or sets the length.